datomusic/duo-imxrt/platform/brains2/components/audio/fsl_adapter_audio.h
/*! @brief HAL Audio DMA channel priority */
typedef enum _hal_audio_dma_channel_priority
{
    kHAL_AudioDmaChannelPriority0 = 0x0U,
    kHAL_AudioDmaChannelPriority1,
    kHAL_AudioDmaChannelPriority2,
    kHAL_AudioDmaChannelPriority3,
    kHAL_AudioDmaChannelPriority4,
    kHAL_AudioDmaChannelPriority5,
    kHAL_AudioDmaChannelPriority6,
    kHAL_AudioDmaChannelPriority7,
    kHAL_AudioDmaChannelPriority8,
    kHAL_AudioDmaChannelPriority9,
    kHAL_AudioDmaChannelPriority10,
    kHAL_AudioDmaChannelPriority11,
    kHAL_AudioDmaChannelPriority12,
    kHAL_AudioDmaChannelPriority13,
    kHAL_AudioDmaChannelPriority14,
    kHAL_AudioDmaChannelPriority15,
    kHAL_AudioDmaChannelPriority16,
    kHAL_AudioDmaChannelPriority17,
    kHAL_AudioDmaChannelPriority18,
    kHAL_AudioDmaChannelPriority19,
    kHAL_AudioDmaChannelPriority20,
    kHAL_AudioDmaChannelPriority21,
    kHAL_AudioDmaChannelPriority22,
    kHAL_AudioDmaChannelPriority23,
    kHAL_AudioDmaChannelPriority24,
    kHAL_AudioDmaChannelPriority25,
    kHAL_AudioDmaChannelPriority26,
    kHAL_AudioDmaChannelPriority27,
    kHAL_AudioDmaChannelPriority28,
    kHAL_AudioDmaChannelPriority29,
    kHAL_AudioDmaChannelPriority30,
    kHAL_AudioDmaChannelPriority31,
    kHAL_AudioDmaChannelPriorityDefault = 0xFFU, /*!< Use default value, not to configure priority. */
} hal_audio_dma_channel_priority_t;

/*! @brief HAL Audio DMA mux user configuration */
typedef struct _hal_audio_dma_mux_config_t
{
    union
    {
        struct
        {
            uint8_t dmaMuxInstance;
            uint32_t dmaRequestSource;
        } dmaMuxConfig;
    };
} hal_audio_dma_mux_config_t;

/*! @brief HAL Audio DMA channel mux user configuration */
typedef struct _hal_audio_dma_channel_mux_config_t
{
    union
    {
        struct
        {
            uint32_t dmaChannelMux;
        } dmaChannelMuxConfig;
    };
} hal_audio_dma_channel_mux_config_t;

/*! @brief HAL Audio DMA user configuration */
typedef struct _hal_audio_dma_config
{
    uint8_t instance;                          /*!< DMA instance */
    uint8_t channel;                           /*!< DMA channel */
    hal_audio_dma_channel_priority_t priority; /*!< DMA channel priority */

    bool enablePreemption;     /*!< If true, a channel can be suspended by other channel with higher priority.
                                    Not all SOCs support this feature. for detailed information please refer to the
                                    SOC corresponding RM. If not supported, the value should be set to false. */
    bool enablePreemptAbility; /*!< If true, a channel can suspend other channel with low priority
                                    Not all SOCs support this feature. for detailed information please refer to the
                                    SOC corresponding RM. If not supported, the value should be set to false. */
    void *dmaMuxConfig;        /*!< The pointer points to an entity defined by hal_audio_dma_mux_config_t.
                                    Not all SOCs support this feature. for detailed information please refer to the
                                    SOC corresponding RM. If not supported, the pointer should be set to NULL. */
    void *dmaChannelMuxConfig; /*!< The pointer points to an entity defined by hal_audio_dma_channel_mux_config_t.
                                    Not all SOCs support this feature. for detailed information please refer to the
                                    SOC corresponding RM. If not supported, the pointer should be set to NULL. */
} hal_audio_dma_config_t;

/*! @brief HAL Audio IP specific feature configuration */
typedef struct _hal_audio_ip_config
{
    union
    {
        /* SAI port use this structure */
        struct
        {
            uint32_t lineMask; /*!< Writing one to the corresponding bit reprsents the corresponding data line is
                                  enabled. lineMask = 0x1U, represents RX0/TX0 data line is enabled.
                                    lineMask = 0xFU, represents RX0-3/TX0-3 data line are enabled. */
            hal_audio_sai_sync_mode_t syncMode; /*!< SAI sync mode, control Tx/Rx clock sync */
        } sai;
    };
} hal_audio_ip_config_t;

/*! @brief HAL Audio configuration structure. */
typedef struct _hal_audio_config
{
    hal_audio_dma_config_t *dmaConfig; /*!< DMA configuration */
    void *ipConfig;                    /*!< IP specific feature configuration. The pointer
                                            points to an entity defined by hal_audio_ip_config_t.
                                            If there is no specific feature configuration, it should be set to NULL. */

    uint32_t srcClock_Hz;   /*!< Source clock  */
    uint32_t sampleRate_Hz; /*!< Sample rate */
    uint16_t frameLength;   /*!< Only flexcomm_i2s uses this field. In most cases, frameLength is equal to bitWidth
                                 times lineChannels. In some cases, frameLength needs to be set to other value.
                                 For example, when the number of bit clock on the bus between two neighboring WS
                                 value is greater than bitWidth times lineChannels, frameLength needs to be set to
                                 the value that is equal to the number of bit clock between two neighboring WS signal.
                                 SAI does not use this field because frameLength can be determined internally
                                 by bitWidth and lineChannels. */

    uint16_t fifoWatermark; /*!< FIFO watermark value. Generally, the value is set to half the number of FIFO(F).
                                 Note that the receive(R) or transmit length(T) is related to fifoWatermark(W) and
                                 bitWidth(B). The relationship between them is: R = N * W * B, T = N * (F - W) * B
                                 (N is integer). On some SOCs, the W and (F - W) is constant 1 and setting the W
                                 does not take effect. In that case the fifoWatermark does not need to be set.
                                 If the value set by application is greater than the number of FIFO,
                                 a maximum value will be used. For example, if the number of FIFO is 32 on a SOC
                                 but the watermark is set to 64 by application, the real value that is written to
                                 register will be 31. */

    hal_audio_master_slave_t msaterSlave;   /*!< master or slave, configure where the bclk and frame sync come from. */
    hal_audio_bclk_polarity_t bclkPolarity; /*!< bclk polarity, data sample on rising edge or falling edge. */

    hal_audio_frame_sync_width_t frameSyncWidth; /*!< Only DSP mode uses this field. For other data format, this field
                                                      does not need to be set and the frameSyncWidth is determined
                                                      internally that depends on different mode. For example, for I2S
                                                      classic mode, frameSyncWidth is equal to bitWidth. */
    hal_audio_frame_sync_polarity_t frameSyncPolarity; /*!< frame sync polarity, frame sync begin at rising or falling
                                                            edge. This field is not used now and reserved for future
                                                            use. The frameSyncPolarity is set internally that depends
                                                            on different mode. For example, for I2S classic mode,
                                                            frameSyncWidth is equal to kHAL_AudioBeginAtFallingEdge. */

    hal_audio_channel_t lineChannels;   /*!< Configure the number of channel on the data line. */
    hal_audio_data_format_t dataFormat; /*!< data format on bus */

