datomusic/duo-imxrt/platform/brains2/components/audio/fsl_adapter_audio.h
    uint8_t bitWidth; /*!< Bit Width */
    uint8_t instance; /*!< Instance (0 - I2S0/SAI0, 1 - I2S1/SAI1, ...), for detailed information please refer to the
                           SOC corresponding RM. Invalid instance value will cause initialization failure. */
} hal_audio_config_t;

/*! @brief HAL Audio transfer structure. */
typedef struct _hal_audio_transfer
{
    uint8_t *data;   /*!< A transfer buffer. */
    size_t dataSize; /*!< A transfer size. */
} hal_audio_transfer_t;

/*! @brief HAL Audio transfer handle. */
typedef void *hal_audio_handle_t;

/*!
 * @brief Defines the Audio handle
 *
 * This macro is used to define a 4 byte aligned Audio handle.
 * Then use "(hal_audio_handle_t)name" to get the Audio handle.
 *
 * The macro should be global and could be optional. You could also define Audio handle by yourself.
 *
 * This is an example,
 * @code
 *   HAL_AUDIO_HANDLE_DEFINE(audioTxHandle);
 * @endcode
 *
 * @param name The name string of the Audio transfer handle.
 */
#define HAL_AUDIO_HANDLE_DEFINE(name) uint32_t name[(HAL_AUDIO_HANDLE_SIZE + sizeof(uint32_t) - 1U) / sizeof(uint32_t)]

/*!
 * @brief HAL Audio completion callback function pointer type.
 *
 * This callback is used only for the non-blocking Audio transfer API. Specify the callback you wish to use
 * in the call to HAL_AudioTxInstallCallback() or HAL_AudioRxInstallCallback().
 *
 * @param handle audio transfer handle pointer, this should be a static variable.
 * @param completionStatus Either #kStatus_HAL_AudioIdle or an error code describing how the transfer completed.
 * @param callbackParam Arbitrary pointer-sized value passed from the application.
 */
typedef void (*hal_audio_transfer_callback_t)(hal_audio_handle_t handle,
                                              hal_audio_status_t completionStatus,
                                              void *callbackParam);

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif /*_cplusplus. */

/*!
 * @name Initialization and de-initialization
 * @{
 */

/*!
 * @brief Initializes the HAL Audio peripheral.
 *
 * @note This API should be called at the beginning of the application.
 * Otherwise, any operation to the HAL Audio module can cause a hard fault
 * because the clock is not enabled. This function configures the audio
 * with user-defined settings. The user can configure the configuration
 * structure. The parameter handle is a pointer to point to a memory space
 * of size #HAL_AUDIO_HANDLE_SIZE allocated by the caller.
 *
 * @note DMA will be initialized and enabled by default in this function and calling
 * HAL_AudioTransferSendNonBlocking or HAL_AudioTransferReceiveNonBlocking will use
 * DMA to transfer data. Thus application should avoid initializing DMA repeatedly
 * and dmaConfig should be configured.
 *
 * Example below shows how to use this API to configure the audio peripheral.
 * For SAI,
 * @code
 *   HAL_AUDIO_HANDLE_DEFINE(audioTxHandle);
 *   hal_audio_config_t audioConfig;
 *   hal_audio_dma_config_t dmaConfig;
 *   hal_audio_ip_config_t ipConfig;
 *   hal_audio_dma_mux_config_t dmaMuxConfig;
 *   dmaMuxConfig.dmaMuxConfig.dmaMuxInstance   = 0;
 *   dmaMuxConfig.dmaMuxConfig.dmaRequestSource = (uint32_t)kDmaRequestMuxSai1Tx;
 *   dmaConfig.instance                         = 0;
 *   dmaConfig.channel                          = 0;
 *   dmaConfig.priority                         = kHAL_AudioDmaChannelPriorityDefault;
 *   dmaConfig.enablePreemption                 = false;
 *   dmaConfig.enablePreemptAbility             = false;
 *   dmaConfig.dmaMuxConfig                     = &dmaMuxConfig;
 *   dmaConfig.dmaChannelMuxConfig              = NULL;
 *   ipConfig.sai.lineMask                      = 1U << 0U;
 *   ipConfig.sai.syncMode                      = kHAL_AudioSaiModeAsync;
 *   audioConfig.dmaConfig                      = &dmaConfig;
 *   audioConfig.ipConfig                       = &ipConfig;
 *   audioConfig.srcClock_Hz                    = 24576000;
 *   audioConfig.sampleRate_Hz                  = (uint32_t)kHAL_AudioSampleRate48KHz;
 *   audioConfig.fifoWatermark                  = 16;
 *   audioConfig.msaterSlave                    = kHAL_AudioMaster;
 *   audioConfig.bclkPolarity                   = kHAL_AudioSampleOnRisingEdge;
 *   audioConfig.frameSyncWidth                 = kHAL_AudioFrameSyncWidthHalfFrame;
 *   audioConfig.frameSyncPolarity              = kHAL_AudioBeginAtFallingEdge;
 *   audioConfig.lineChannels                   = kHAL_AudioStereo;
 *   audioConfig.dataFormat                     = kHAL_AudioDataFormatI2sClassic;
 *   audioConfig.bitWidth                       = (uint8_t)kHAL_AudioWordWidth16bits;
 *   audioConfig.instance                       = 0U;
 *   HAL_AudioTxInit((hal_audio_handle_t)audioTxHandle, &audioConfig);
 * @endcode
 * For I2S,
 * @code
 *   HAL_AUDIO_HANDLE_DEFINE(audioTxHandle);
 *   hal_audio_config_t     audioConfig;
 *   hal_audio_dma_config_t dmaConfig;
 *   dmaConfig.instance             = 0;
 *   dmaConfig.channel              = 0;
 *   dmaConfig.priority             = kHAL_AudioDmaChannelPriorityDefault;
 *   dmaConfig.enablePreemption     = false;
 *   dmaConfig.enablePreemptAbility = false;
 *   dmaConfig.dmaMuxConfig         = NULL;
 *   dmaConfig.dmaChannelMuxConfig  = NULL;
 *   audioConfig.dmaConfig          = &dmaConfig;
 *   audioConfig.ipConfig           = NULL;
 *   audioConfig.srcClock_Hz        = 24576000;
 *   audioConfig.sampleRate_Hz      = (uint32_t)kHAL_AudioSampleRate48KHz;
 *   audioConfig.fifoWatermark      = 0;
 *   audioConfig.msaterSlave        = kHAL_AudioMaster;
 *   audioConfig.bclkPolarity       = kHAL_AudioSampleOnRisingEdge;
 *   audioConfig.frameSyncWidth     = kHAL_AudioFrameSyncWidthHalfFrame;
 *   audioConfig.frameSyncPolarity  = kHAL_AudioBeginAtFallingEdge;
 *   audioConfig.lineChannels       = kHAL_AudioStereo;
 *   audioConfig.dataFormat         = kHAL_AudioDataFormatI2sClassic;
 *   audioConfig.bitWidth           = (uint8_t)kHAL_AudioWordWidth16bits;
 *   audioConfig.instance           = 0U;
 *   HAL_AudioTxInit((hal_audio_handle_t)audioTxHandle, &audioConfig);
 * @endcode
 *
 * @param handle Pointer to point to a memory space of size #HAL_AUDIO_HANDLE_SIZE allocated by the caller.
 * The handle should be 4 byte aligned, because unaligned access doesn't be supported on some devices.
 * You can define the handle in the following two ways:
 * #HAL_AUDIO_HANDLE_DEFINE(handle);
 * or
 * uint32_t handle[((HAL_AUDIO_HANDLE_SIZE + sizeof(uint32_t) - 1U) / sizeof(uint32_t))];
 * @param config A pointer to the audio configuration structure
 * @retval kStatus_HAL_AudioSuccess audio initialization succeed
 */
hal_audio_status_t HAL_AudioTxInit(hal_audio_handle_t handle, const hal_audio_config_t *config);

/*!
 * @brief Initializes the HAL Audio peripheral.
 *
 * @note This API should be called at the beginning of the application.
 * Otherwise, any operation to the HAL Audio module can cause a hard fault
 * because the clock is not enabled. This function configures the audio
 * with user-defined settings. The user can configure the configuration
 * structure. The parameter handle is a pointer to point to a memory space
 * of size #HAL_AUDIO_HANDLE_SIZE allocated by the caller.
 *
 * @note DMA will be initialized and enabled by default in this function and calling
 * HAL_AudioTransferSendNonBlocking or HAL_AudioTransferReceiveNonBlocking will use
 * DMA to transfer data. Thus application should avoid initializing DMA repeatedly
 * and dmaConfig should be configured.
 *
 * Example below shows how to use this API to configure the audio peripheral.
 * For SAI,
 * @code
 *   HAL_AUDIO_HANDLE_DEFINE(audioRxHandle);
 *   hal_audio_config_t audioConfig;
 *   hal_audio_dma_config_t dmaConfig;
 *   hal_audio_ip_config_t ipConfig;
 *   hal_audio_dma_mux_config_t dmaMuxConfig;
 *   dmaMuxConfig.dmaMuxConfig.dmaMuxInstance   = 0;
 *   dmaMuxConfig.dmaMuxConfig.dmaRequestSource = (uint32_t)kDmaRequestMuxSai1Rx;
 *   dmaConfig.instance                         = 0;
 *   dmaConfig.channel                          = 0;
 *   dmaConfig.priority                         = kHAL_AudioDmaChannelPriorityDefault;
 *   dmaConfig.enablePreemption                 = false;
 *   dmaConfig.enablePreemptAbility             = false;
 *   dmaConfig.dmaMuxConfig                     = &dmaMuxConfig;
 *   dmaConfig.dmaChannelMuxConfig              = NULL;
 *   ipConfig.sai.lineMask                      = 1U << 0U;
 *   ipConfig.sai.syncMode                      = kHAL_AudioSaiModeAsync;
 *   audioConfig.dmaConfig                      = &dmaConfig;
 *   audioConfig.ipConfig                       = &ipConfig;
 *   audioConfig.srcClock_Hz                    = 24576000;
 *   audioConfig.sampleRate_Hz                  = (uint32_t)kHAL_AudioSampleRate48KHz;
 *   audioConfig.fifoWatermark                  = 16;
 *   audioConfig.msaterSlave                    = kHAL_AudioMaster;
 *   audioConfig.bclkPolarity                   = kHAL_AudioSampleOnRisingEdge;
 *   audioConfig.frameSyncWidth                 = kHAL_AudioFrameSyncWidthHalfFrame;
 *   audioConfig.frameSyncPolarity              = kHAL_AudioBeginAtFallingEdge;
 *   audioConfig.lineChannels                   = kHAL_AudioStereo;
 *   audioConfig.dataFormat                     = kHAL_AudioDataFormatI2sClassic;
 *   audioConfig.bitWidth                       = (uint8_t)kHAL_AudioWordWidth16bits;
 *   audioConfig.instance                       = 0U;
 *   HAL_AudioRxInit((hal_audio_handle_t)audioRxHandle, &audioConfig);
 * @endcode
 * For I2S,
 * @code
 *   HAL_AUDIO_HANDLE_DEFINE(audioRxHandle);
 *   hal_audio_config_t     audioConfig;
 *   hal_audio_dma_config_t dmaConfig;
 *   dmaConfig.instance             = 0;
 *   dmaConfig.channel              = 0;
 *   dmaConfig.priority             = kHAL_AudioDmaChannelPriorityDefault;
 *   dmaConfig.enablePreemption     = false;
 *   dmaConfig.enablePreemptAbility = false;
 *   dmaConfig.dmaMuxConfig         = NULL;
 *   dmaConfig.dmaChannelMuxConfig  = NULL;
 *   audioConfig.dmaConfig          = &dmaConfig;
 *   audioConfig.ipConfig           = NULL;
 *   audioConfig.srcClock_Hz        = 24576000;
 *   audioConfig.sampleRate_Hz      = (uint32_t)kHAL_AudioSampleRate48KHz;
 *   audioConfig.fifoWatermark      = 0;
 *   audioConfig.msaterSlave        = kHAL_AudioMaster;
 *   audioConfig.bclkPolarity       = kHAL_AudioSampleOnRisingEdge;
 *   audioConfig.frameSyncWidth     = kHAL_AudioFrameSyncWidthHalfFrame;
 *   audioConfig.frameSyncPolarity  = kHAL_AudioBeginAtFallingEdge;
 *   audioConfig.lineChannels       = kHAL_AudioStereo;
 *   audioConfig.dataFormat         = kHAL_AudioDataFormatI2sClassic;
 *   audioConfig.bitWidth           = (uint8_t)kHAL_AudioWordWidth16bits;
 *   audioConfig.instance           = 0U;
 *   HAL_AudioRxInit((hal_audio_handle_t)audioRxHandle, &audioConfig);
 * @endcode
 *
 * @param handle Pointer to point to a memory space of size #HAL_AUDIO_HANDLE_SIZE allocated by the caller.
 * The handle should be 4 byte aligned, because unaligned access doesn't be supported on some devices.
 * You can define the handle in the following two ways:
 * #HAL_AUDIO_HANDLE_DEFINE(handle);
 * or
 * uint32_t handle[((HAL_AUDIO_HANDLE_SIZE + sizeof(uint32_t) - 1U) / sizeof(uint32_t))];
 * @param config A pointer to the audio configuration structure
 * @retval kStatus_HAL_AudioSuccess audio initialization succeed
 */
hal_audio_status_t HAL_AudioRxInit(hal_audio_handle_t handle, const hal_audio_config_t *config);

/*!
 * @brief De-initializes the HAL Audio peripheral. Call this API to gate the HAL Audio clock.
 * The HAL Audio module can't work unless the HAL_AudioTxInit is called.
 *
 * @param handle audio handle pointer, this should be a static variable.
 * @retval kStatus_HAL_AudioSuccess audio de-initialization succeed */
hal_audio_status_t HAL_AudioTxDeinit(hal_audio_handle_t handle);
/*!
 * @brief De-initializes the HAL Audio peripheral. Call this API to gate the HAL Audio clock.
 * The HAL Audio module can't work unless the HAL_AudioRxInit is called.
 *
 * @param handle audio handle pointer, this should be a static variable.
 * @retval kStatus_HAL_AudioSuccess audio de-initialization succeed */
hal_audio_status_t HAL_AudioRxDeinit(hal_audio_handle_t handle);

/*! @} */

/*!
 * @name Transactional
 * @{
 */

/*!
 * @brief Installs a callback and callback parameter.
 *
 * This function is used to install the callback and callback parameter for audio module.
 * When any status of the audio changed, the driver will notify the upper layer by the installed callback
 * function. And the status is also passed as status parameter when the callback is called.
 *
 * @param handle audio handle pointer, this should be a static variable.
 * @param callback pointer to user callback function.
 * @param callbackParam user parameter passed to the callback function.
 * @retval kStatus_HAL_AudioSuccess audio tx transfer handle created
 */
hal_audio_status_t HAL_AudioTxInstallCallback(hal_audio_handle_t handle,
                                              hal_audio_transfer_callback_t callback,
                                              void *callbackParam);
/*!
 * @brief Installs a callback and callback parameter.
 *
 * This function is used to install the callback and callback parameter for audio module.
 * When any status of the audio changed, the driver will notify the upper layer by the installed callback
 * function. And the status is also passed as status parameter when the callback is called.
 *
 * @param handle audio handle pointer, this should be a static variable.
 * @param callback pointer to user callback function.
 * @param callbackParam user parameter passed to the callback function.
 * @retval kStatus_HAL_AudioSuccess audio rx transfer handle created
 */
hal_audio_status_t HAL_AudioRxInstallCallback(hal_audio_handle_t handle,
                                              hal_audio_transfer_callback_t callback,
                                              void *callbackParam);

/*!
 * @brief Performs a DMA non-blocking send on the data bus.
 *
 * @note Calling the API returns immediately after transfer initiates. The user can
 * call HAL_AudioTransferGetSendCount to poll the transfer status to check whether
 * the transfer is finished. If the return status is kStatus_HAL_AudioIdle, the transfer
 * is finished.
 *
 * @param handle audio handle pointer, this should be a static variable.
 * @param xfer pointer to hal_audio_transfer_t structure.
 *
 * @note The transmit length(T) is related to fifoWatermark(W), bitWidth(B) and the number of FIFO(F).
 * The relationship between them is: T = N * (F - W) * B (N is integer).
 *
 * @retval kStatus_HAL_AudioSuccess Successfully start the data transmission.
 * @retval kStatus_HAL_AudioBusy Previous transmission still not finished.
 * @retval kStatus_HAL_AudioError An error occurred.
 */
hal_audio_status_t HAL_AudioTransferSendNonBlocking(hal_audio_handle_t handle, hal_audio_transfer_t *xfer);

/*!
 * @brief Performs a DMA non-blocking receive on the HAL Audio bus.
 *
 * @note Calling the API returns immediately after transfer initiates. The user can
 * call HAL_AudioTransferGetReceiveCount to poll the transfer status to check whether
 * the transfer is finished. If the return status is kStatus_HAL_AudioIdle, the transfer
 * is finished.
 *
 * @param handle audio handle pointer, this should be a static variable.
 * @param xfer pointer to hal_audio_transfer_t structure.
 *
 * @note The receive length(R) is related to fifoWatermark(W), bitWidth(B) and the number of FIFO(F).
 * The relationship between them is: R = N * W * B (N is integer).
 *
 * @retval kStatus_HAL_AudioSuccess Successfully start the data transmission.
 * @retval kStatus_HAL_AudioBusy Previous transmission still not finished.
 * @retval kStatus_HAL_AudioError An error occurred.
 */
hal_audio_status_t HAL_AudioTransferReceiveNonBlocking(hal_audio_handle_t handle, hal_audio_transfer_t *xfer);

/*!
 * @brief Aborts a DMA non-blocking transfer early.
 *
 * @note This API can be called at any time when a DMA non-blocking transfer initiates
 * to abort the transfer early.
 *
 * @param handle audio handle pointer, this should be a static variable.
 * @retval kStatus_HAL_AudioSuccess Successfully abort the transfer.
 */
hal_audio_status_t HAL_AudioTransferAbortSend(hal_audio_handle_t handle);

/*!
 * @brief Aborts a DMA non-blocking transfer early.
 *
 * @note This API can be called at any time when a DMA non-blocking transfer initiates
 * to abort the transfer early.
 *
 * @param handle audio handle pointer, this should be a static variable.
 * @retval kStatus_HAL_AudioSuccess Successfully abort the transfer.
 */
hal_audio_status_t HAL_AudioTransferAbortReceive(hal_audio_handle_t handle);

/*!
 * @brief Gets the tx transfer status during a DMA non-blocking transfer.
 *
 * @param handle audio handle pointer, this should be a static variable.
 * @param count Number of bytes sent so far by the non-blocking transaction.
 * @retval kStatus_HAL_AudioSuccess Successfully return the count.
 * @retval kStatus_HAL_AudioIdle Previous transmission has been finished.
 * @retval kStatus_HAL_AudioError An error occurred.
 */
hal_audio_status_t HAL_AudioTransferGetSendCount(hal_audio_handle_t handle, size_t *count);
/*!
 * @brief Gets the rx transfer status during a DMA non-blocking transfer.
 *
 * @param handle audio handle pointer, this should be a static variable.
 * @param count Number of bytes received so far by the non-blocking transaction.
 * @retval kStatus_HAL_AudioSuccess Successfully return the count.
 * @retval kStatus_HAL_AudioIdle Previous transmission has been finished.
 * @retval kStatus_HAL_AudioError An error occurred.
 */
hal_audio_status_t HAL_AudioTransferGetReceiveCount(hal_audio_handle_t handle, size_t *count);

/*! @} */

#if defined(__cplusplus)
}
#endif /*_cplusplus. */
/*! @} */

#endif /* __HAL_AUDIO_ADAPTER_H__*/
